## <font color='purple'><h3 align='center'>Different ways of Creating DataFrame</h3></font>

## <font color='black'>Using csv

In [2]:
import pandas as pd
import numpy as np
df = pd.read_csv('C:/Users/Compaq/Downloads/Code Basics-DS/Python-Pandas/py-master/pandas/3_different_ways_of_creating_dataframe/weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

## <font color='blackwhite'>Using excel</font>

In [9]:
df = pd.read_excel('C:/Users/Compaq/Downloads/Code Basics-DS/Python-Pandas/py-master/pandas/3_different_ways_of_creating_dataframe/weather_data.xlsx')
df

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02           35          7  Sunny
2 2017-01-03           28          2   Snow

## <font color='blackblue'>Using dictionary</font>

In [14]:
df = {'Names':['Varun Chakravarthy','Lockie Ferguson','Andre Russell','Prasidh Krishna','Sunil Narine'],
                 'Maiden':[0,0,0,0,0],
                 'Runs':[13,24,9,24,20],
                 'Wickets':[3,2,3,1,0],
                 'Economy Rate':[3.2,6,3,6,5]}

df = pd.DataFrame(df)
df

                Names  Maiden  Runs  Wickets  Economy Rate
0  Varun Chakravarthy       0    13        3           3.2
1     Lockie Ferguson       0    24        2           6.0
2       Andre Russell       0     9        3           3.0
3     Prasidh Krishna       0    24        1           6.0
4        Sunil Narine       0    20        0           5.0

## <font color='redwhite'>Using tuples list</font>

In [23]:
Top5_IIT = [('IIT-Madras','IIT-M','Aerospace Engineering',1506,2995),('IIT-Bombay','IIT-B','Civil Engineering',949,1780),
            ('IIT-Kharakpur','IITKgp','Chemical Engineering',1046,2308),
            ('IIT-Delhi','IIT-D','Computer Science Engineering',160,262),
            ('IIT-Kanpur','IITK','Mechanical Engineering',917,1409)]
df = pd.DataFrame(data=Top5_IIT,columns=['Name of IIT College','IIT Code','Course Name','Opening Rank','Closing Rank'])
df

,Name of IIT College,IIT Code,Course Name,Opening Rank,Closing Rank
0,IIT-Madras,IIT-M,Aerospace Engineering,1506,2995
1,IIT-Bombay,IIT-B,Civil Engineering,949,1780
2,IIT-Kharakpur,IITKgp,Chemical Engineering,1046,2308
3,IIT-Delhi,IIT-D,Computer Science Engineering,160,262
4,IIT-Kanpur,IITK,Mechanical Engineering,917,1409

**Creating A DataFrame using list of dictionaries**

In [3]:
df = pd.DataFrame([{'Name':'Ranga','Qualification':'SSC','Class':'Distinction'},
                   {'Name':'Naveen','Qualification':'Diploma','Class':'First Class'},
                   {'Name':'Vijay','Qualification':'B.Tech','Class':'Fisrt Class'},
                   {'Name':'Sreeramulu','Qualification':'Degree','Class':'First Class'}])
df

         Name Qualification        Class
0       Ranga           SSC  Distinction
1      Naveen       Diploma  First Class
2       Vijay        B.Tech  Fisrt Class
3  Sreeramulu        Degree  First Class

## <font color='blackyellow'>Using list of dictionaries</font>

In [26]:
df = [
    {'University':'SKU','Score':51.10,'Rank':24},
    {'University':'KLU','Score':48.57,'Rank':35},
    {'University':'SVU','Score':45.61,'Rank':54},
    {'University':'RLU','Score':30.10,'Rank':50}
]

df = pd.DataFrame(data=df,columns=['University','Score','Rank'])
df

  University  Score  Rank
0        SKU  51.10    24
1        KLU  48.57    35
2        SVU  45.61    54
3        RLU  30.10    50